_Rarzrabotki/Rarus/USO2/Documents/УСОERP_РасходМатериаловВСтроительстве.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_РасходМатериаловВСтроительстве</Name>
			<Comment>Расход материалов в строительстве</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УСОERP_РасходМатериаловВСтроительстве</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыОперацийРасходаМатериаловВСтроительстве</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПланов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУтверждения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_УтверждениеКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаОбъема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/AccumulationRegisters/ТоварыПереданныеПереработчику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыПереданныеПереработчику</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидЗапасов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОтгрузке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КонтролироватьОстатки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ВидыОперацийРасходаМатериаловВСтроительстве.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ВидыОперацийРасходаМатериаловВСтроительстве</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СобственныеМатериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериалыПереданныеСубподрядчику</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ВариантыИспользованияХарактеристикНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВариантыИспользованияХарактеристикНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеИспользовать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщиеДляВидаНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныеДляНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщиеСДругимВидомНоменклатуры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыНоменклатуры</xr:Item>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принципал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_РасходМатериаловВСтроительстве/Forms/ФормаПодбораМатериалов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Заголовок = "Подбор материалов для строительной работы: " + Символы.ПС + Параметры.Работа;
	
	ВидОперации =	 Параметры.ВидОперации;
	НачалоПериода =	 Параметры.НачалоПериода;
	КонецПериода =	 Параметры.КонецПериода;
	Склад =			 Параметры.Склад;
	Партнер =		 Параметры.Партнер;
	Контрагент =	 Параметры.Контрагент;
	Договор =		 Параметры.Договор;
	Соглашение =	 Параметры.Соглашение;
	
	Работа = Параметры.Работа;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаМатериаловНаСкладах, "КонецПериода",	Новый Граница(КонецДня(Параметры.КонецПериода), ВидГраницы.Включая),Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаМатериаловНаСкладах, "Склад",			Параметры.Склад, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаМатериаловНаСкладах, "ВидОперации",	Параметры.ВидОперации, Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаМатериаловПереданных, "КонецПериода",	Новый Граница(КонецДня(Параметры.КонецПериода), ВидГраницы.Включая),Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаМатериаловПереданных, "Склад",		Параметры.Склад, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаМатериаловПереданных, "Поставщик",	Параметры.Партнер, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаМатериаловПереданных, "Контрагент",	Параметры.Контрагент,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаМатериаловПереданных, "Соглашение",	Параметры.Соглашение, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаМатериаловПереданных, "Договор",		Параметры.Договор, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТаблицаМатериаловПереданных, "ВидОперации",	Параметры.ВидОперации, Истина);

	Элементы.ГруппаМатериалыПереданныеСубподрядчику.Видимость = (Параметры.ВидОперации = Перечисления.УСОERP_ВидыОперацийРасходаМатериаловВСтроительстве.МатериалыПереданныеСубподрядчику);
	Элементы.ГруппаСобственныеМатериалы.Видимость 			  = (Параметры.ВидОперации = Перечисления.УСОERP_ВидыОперацийРасходаМатериаловВСтроительстве.СобственныеМатериалы);
	
	ТекущийСписокНоменклатуры = ?(ВидОперации = перечисления.УСОERP_ВидыОперацийРасходаМатериаловВСтроительстве.МатериалыПереданныеСубподрядчику, "ТаблицаМатериаловПереданных", "ТаблицаМатериаловНаСкладах");
		
	КодФормы = "Форма_ПодборМатериаловДляОтраженияРасходаВСтроительстве";
	
	Настройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(КодФормы, "");
	Если ТипЗнч(Настройки) = Тип("Структура") Тогда
		Если Настройки.Свойство("ТекущаяИерархияНоменклатуры") тогда
			Если ЗначениеЗаполнено(Настройки.ТекущаяИерархияНоменклатуры) Тогда
				Элементы.ИерархияНоменклатуры.ТекущаяСтрока = Настройки.ТекущаяИерархияНоменклатуры;
				ТекущаяИерархияНоменклатуры = Настройки.ТекущаяИерархияНоменклатуры;
			КонецЕсли;
		КонецЕсли;
		Если Настройки.Свойство("ТолькоВНаличии") тогда
			ТолькоВНаличии =  Настройки.ТолькоВНаличии;
		КонецЕсли;
		Если Настройки.Свойство("ИспользоватьФильтры") тогда
			ИспользоватьФильтры =  Настройки.ИспользоватьФильтры;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьСнятьФильтрПоИерархии();
	УстановитьОтборТолькоВНаличииНаСервере();
	
	УстановитьУсловноеОформление();


КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	СохранитьЗначенияНастроекФормыНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРеквизитовФормы

&НаКлиенте
Процедура ТолькоВНаличииПриИзменении(Элемент)
	
	УстановитьОтборТолькоВНаличииНаСервере();
		
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьФильтрыПриИзменении(Элемент)
	УстановитьСнятьФильтрПоИерархии();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицФормыТаблицаМатериалыНаСкладах

&НаКлиенте
Процедура ТаблицаМатериаловНаСкладахВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Не ЗначениеЗаполнено(ВыбраннаяСтрока) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы[ТекущийСписокНоменклатуры].ТекущиеДанные;
	
	ХарактеристикиИспользуются = ПолучитьПризнакХарактеристикиИспользуются(ВыбраннаяСтрока);
	Если ХарактеристикиИспользуются Тогда
		ТекущаяНоменклатура = ВыбраннаяСтрока;
		Элементы.ГруппаХарактеристики.Видимость = Истина;
		Элементы.ГруппаМатериалы.Видимость = Ложь;

		ЗаполнитьХарактеристикиНоменклатурыНаСервере();
	Иначе
		мПараметрыФормы = Новый Структура;
		мПараметрыФормы.Вставить("Номенклатура", ВыбраннаяСтрока);
		мПараметрыФормы.Вставить("КоличествоОстаток", ТекущиеДанные.КоличествоОстаток);
		мПараметрыФормы.Вставить("ХарактеристикиИспользуются", ХарактеристикиИспользуются);
		
		
		ПараметрыМатериалов = Новый Структура;
		ОткрытьФорму("Документ.УСОERP_РасходМатериаловВСтроительстве.Форма.ФормаВводаКоличества", мПараметрыФормы,,,,,Новый ОписаниеОповещения("ДобавитьМатериалыВТаблицу", ЭтотОбъект,ПараметрыМатериалов),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		
	КонецЕсли;   	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицФормыТаблицаМатериалыПереданные

&НаКлиенте
Процедура ТаблицаМатериаловПереданныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Не ЗначениеЗаполнено(ВыбраннаяСтрока) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы[ТекущийСписокНоменклатуры].ТекущиеДанные;
	
	ХарактеристикиИспользуются = ПолучитьПризнакХарактеристикиИспользуются(ВыбраннаяСтрока);
	Если ХарактеристикиИспользуются Тогда
		ТекущаяНоменклатура = ВыбраннаяСтрока;
		Элементы.ГруппаХарактеристики.Видимость = Истина;
		Элементы.ГруппаМатериалы.Видимость = Ложь;

		ЗаполнитьХарактеристикиНоменклатурыНаСервере();
	Иначе
		мПараметрыФормы = Новый Структура;
		мПараметрыФормы.Вставить("Номенклатура", ВыбраннаяСтрока);
		мПараметрыФормы.Вставить("КоличествоОстаток", ТекущиеДанные.КоличествоОстаток);
		мПараметрыФормы.Вставить("ХарактеристикиИспользуются", ХарактеристикиИспользуются);
		
		
		ПараметрыМатериалов = Новый Структура;
		ОткрытьФорму("Документ.УСОERP_РасходМатериаловВСтроительстве.Форма.ФормаВводаКоличества", мПараметрыФормы,,,,,Новый ОписаниеОповещения("ДобавитьМатериалыВТаблицу", ЭтотОбъект,ПараметрыМатериалов),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		
	КонецЕсли;  
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицФормыТаблицаХарактеристик

&НаКлиенте
Процедура ТаблицаХарактеристикВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ТаблицаХарактеристик.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбраннаяСтрокаХарактеристики = ПолучитьВыбраннуюХарактеристику(ТекущиеДанные.ПолучитьИдентификатор());
	
	мПараметрыФормы = Новый Структура;
	мПараметрыФормы.Вставить("Номенклатура", ТекущаяНоменклатура);
	мПараметрыФормы.Вставить("Характеристика", ВыбраннаяСтрокаХарактеристики.Характеристика);
	мПараметрыФормы.Вставить("КоличествоОстаток", ВыбраннаяСтрокаХарактеристики.КоличествоОстаток);
	мПараметрыФормы.Вставить("ХарактеристикиИспользуются", Истина);
	
	
	ПараметрыМатериалов = Новый Структура;
	ОткрытьФорму("Документ.УСОERP_РасходМатериаловВСтроительстве.Форма.ФормаВводаКоличества", мПараметрыФормы,,,,,Новый ОписаниеОповещения("ДобавитьМатериалыВТаблицу", ЭтотОбъект,ПараметрыМатериалов),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	

	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицФормыИерархияНоменклатуры

&НаКлиенте
Процедура ИерархияНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ИерархияНоменклатурыПриАктивизацииСтроки(Элемент)
	
	УстановитьСнятьФильтрПоИерархии();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ПоместитьВыбранныеМатериалыВХранилище();
	ПарметрыВозврата = Новый Структура;
	ПарметрыВозврата.Вставить("АдресМатериаловВоВременномХранилище", АдресВоВременномХранилище);
	ПарметрыВозврата.Вставить("Работа", Работа);
	
	Закрыть( ПарметрыВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура КарточкаНоменклатуры(Команда)
	
	ТекущиеДанные = Неопределено;
	ТекущиеДанные = Элементы[ТекущийСписокНоменклатуры].ТекущиеДанные;
		
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	мНоменклатура = ТекущиеДанные.Номенклатура;
	Если Не ЗначениеЗаполнено(мНоменклатура) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ФормаОбъекта = ПолучитьФорму("Справочник.Номенклатура.ФормаОбъекта", Новый Структура("Ключ", мНоменклатура));
		ФормаОбъекта.Открыть();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьсяКВыборуМатериала(Команда)
	Элементы.ГруппаМатериалы.Видимость = Истина;
	Элементы.ГруппаХарактеристики.Видимость = Ложь;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборТолькоВНаличииНаСервере()
	
	ГруппаОтбораТолькоВНаличииНоменклатура = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
					ОбщегоНазначенияУТКлиентСервер.ПолучитьОтборДинамическогоСписка(ЭтаФорма[ТекущийСписокНоменклатуры]).Элементы,
					"ГруппаТолькоВНаличии", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
					ГруппаОтбораТолькоВНаличииНоменклатура,
					"КоличествоОстаток", 0, ВидСравненияКомпоновкиДанных.Больше,,ТолькоВНаличии);

	
КонецПроцедуры

&НаСервере
Процедура УстановитьСнятьФильтрПоИерархии()
	
		
	ТекущаяИерархияНоменклатуры = Элементы.ИерархияНоменклатуры.ТекущаяСтрока;
			
	Если Элементы.ИерархияНоменклатуры.ТекущаяСтрока = Неопределено Тогда
		ОтборПоИерархииНоменклатуры = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	Иначе
		ОтборПоИерархииНоменклатуры = Элементы.ИерархияНоменклатуры.ТекущаяСтрока;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭтаФорма[ТекущийСписокНоменклатуры], "Родитель", ОтборПоИерархииНоменклатуры, 
		ВидСравненияКомпоновкиДанных.Равно, "Родитель", ИспользоватьФильтры);


КонецПроцедуры

&НаСервере
Процедура СохранитьЗначенияНастроекФормыНаСервере()
	
	НастройкиФормыПодбора = Новый Структура;
	НастройкиФормыПодбора.Вставить("ТекущаяИерархияНоменклатуры", ТекущаяИерархияНоменклатуры);
	НастройкиФормыПодбора.Вставить("ИспользоватьФильтры", ИспользоватьФильтры);
	НастройкиФормыПодбора.Вставить("ТолькоВНаличии", ТолькоВНаличии);
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(КодФормы, , НастройкиФормыПодбора);
	

КонецПроцедуры

&НаСервере
Функция ПолучитьПризнакХарактеристикиИспользуются(Номенклатура)
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат ложь;
	КонецЕсли;
	
	Возврат (Номенклатура.ИспользованиеХарактеристик <> Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать);
	
КонецФункции

&НаКлиенте
Процедура ДобавитьМатериалыВТаблицу(ПодобранныеМатериалы, ДополнительныеПараметры) Экспорт
	
	Если ПодобранныеМатериалы<> Неопределено Тогда
		ДобавитьМатериалыВТаблицуНаСервере(ПодобранныеМатериалы, ДополнительныеПараметры);
	КонецЕсли;
 
КонецПроцедуры

&НаСервере
Процедура ДобавитьМатериалыВТаблицуНаСервере(ПодобранныеМатериалы, ДополнительныеПараметры)
	
	Если НЕ ПодобранныеМатериалы.ПереноситьВДокумент Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиТаблицыМатериалов = ВыбранныеМатериалы.НайтиСтроки( Новый Структура("Номенклатура, Характеристика", ПодобранныеМатериалы.Номенклатура, ПодобранныеМатериалы.Характеристика));
	
	Если СтрокиТаблицыМатериалов.Количество() = 0 Тогда
		НоваяСтрока = ВыбранныеМатериалы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ПодобранныеМатериалы);
	Иначе
		СтрокиТаблицыМатериалов[0].Количество = СтрокиТаблицыМатериалов[0].Количество + ПодобранныеМатериалы.Количество;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьХарактеристикиНоменклатурыНаСервере()
	
	ТаблицаХарактеристик.Очистить();
	Запрос = Новый Запрос;
	Если ВидОперации = Перечисления.УСОERP_ВидыОперацийРасходаМатериаловВСтроительстве.МатериалыПереданныеСубподрядчику Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыПереданныеПереработчикуОстатки.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
		|	СУММА(ЕСТЬNULL(ТоварыПереданныеПереработчикуОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыПереданныеПереработчику.Остатки(
		|			&КонецПериода,
		|			АналитикаУчетаНоменклатуры.СкладскаяТерритория = &Склад
		|				И АналитикаУчетаНоменклатуры.Номенклатура = &Номенклатура
		|				И ВидЗапасов.ВладелецТовара = &Поставщик
		|				И ВидЗапасов.Контрагент = &Контрагент
		|				И ВидЗапасов.Договор = &Договор
		|				И ВидЗапасов.Соглашение = &Соглашение) КАК ТоварыПереданныеПереработчикуОстатки
		|ГДЕ
		|	ЕСТЬNULL(ТоварыПереданныеПереработчикуОстатки.КоличествоОстаток, 0) > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыПереданныеПереработчикуОстатки.АналитикаУчетаНоменклатуры.Характеристика";

	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыНаСкладахОстатки.Характеристика,
		|	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0)) КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			&КонецПериода,
		|			Склад = &Склад
		|				И Номенклатура = &Номенклатура) КАК ТоварыНаСкладахОстатки
		|ГДЕ
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыНаСкладахОстатки.Характеристика
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТоварыНаСкладахОстатки.Характеристика.Наименование";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("КонецПериода", Новый Граница(КонецДня(КонецПериода), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Номенклатура", ТекущаяНоменклатура);
	Запрос.УстановитьПараметр("Поставщик", Партнер);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Соглашение", Соглашение);
	
	Результат = Запрос.Выполнить();
	
	ТаблицаХарактеристик.Загрузить(Результат.Выгрузить());
	
Конецпроцедуры

&НаСервере
Функция ПолучитьВыбраннуюХарактеристику(ИдентификаторСтроки)
	
	Если ИдентификаторСтроки = Неопределено Тогда
		Возврат Новый Структура("Характеристика, КоличествоОстаток", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), 0);
	КонецЕсли;
	
	ТекущаяСтрока = ТаблицаХарактеристик.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат Новый Структура("Характеристика, КоличествоОстаток", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), 0);
	КонецЕсли;

	Возврат Новый Структура("Характеристика, КоличествоОстаток",ТекущаяСтрока.Характеристика, ТекущаяСтрока.КоличествоОстаток);
	
КонецФункции

&НаСервере
Процедура ПоместитьВыбранныеМатериалыВХранилище()
	
	ТаблицаВыбранныхМатериалов = ВыбранныеМатериалы.Выгрузить();
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ТаблицаВыбранныхМатериалов, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

		
	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтаФорма, 
																			 "ВыбранныеМатериалыХарактеристика",
																		     "ВыбранныеМатериалы.ХарактеристикиИспользуются");

	
КонецПроцедуры

#КонецОбласти
